ROOT.add_DB('db剧本提示', {

	DB: {

		提示id: {
			类型: 'ID',
			主键: true,
			自增加: true,
		},

		剧本id: {
			类型: 'ID',
			引用: 'db剧本',
		},

		分钟偏移: {

			类型: '数',

			单位: '分钟',

			最大: 90,

			最小: 0,
		},

		时长: {
			类型: '数',
			// 记录声音的时长
			单位: '秒',
		},

		声音: {

			类型: '声音',

			时长限制: 12, // 秒

		},

	},

	BUF: {
		DB: 'ALL',
	},

	Item: {

		大标题f: [ // '过 6 分钟'

			['SF_字串连加', // 
				'FLY', '大标题f', // 结果保存位置
				'常串', '过 ', // 
				'BX', '分钟偏移', // 
				'常串', ' 分钟', // 
			], //

		],

		小标题f: [ // '时长 23 秒'

			['SF_字串连加', // 
				'FLY', '小标题f', // 结果保存位置
				'常串', '时长 ', // 
				'BX', '时长', // 
				'常串', ' 秒', // 
			], //

		],

	},

	DEL: {
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我是管理员', ], // 

		],
		// ---------------------------------

	},

	EDIT: {

		VIEW: [ // ---------------------
			['显示', '剧本id'], //
			['_'], //
			['输入', '分钟偏移'], //
			['输入', '声音'], //
		],
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我是管理员', ], // 

		],
		// ---------------------------------

	},

	// 
	NEW: {

		搜索: [ // -------VIEW那里要显示剧本
			['剧本id'], // 
		],

		VIEW: [ // ---------------------
			['显示', '剧本id'], //
			['_', '显示', ''], //
			['输入', '分钟偏移'], //
			['输入', '声音'], //
		],
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我是管理员', ], // 

		],

	},

});