ROOT.add_DB('db孩子', {

	DB: { // 表项class
		孩子id: {
			类型: 'ID',

			主键: true,
			自增加: true,
		},

		家庭id: {
			类型: 'ID',
			引用: 'db家庭',

		},

		孩子昵称: {
			类型: '昵称',
			数碑: true,
		},

		存款时间: {
			类型: '数',

			初值: 100,

		},

		孩子年龄: {
			类型: '数',
			最大: 12,
			最小: 3,
		},

	},

	Item: {
		大标题b: '孩子昵称',
		小标题b: '存款时间',

		样式: '单行按键B',
	},

	BUF: {
		BC: 'ALL',
	},

	DEL: {

		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我的家庭', // 
				'BX', '家庭id'
			], // 

			['MF_我是管理员', ], // 

		],

	},

	EDIT: {

		VIEW: [ // =========
			['显示', '家庭id'], //
			['输入', '孩子昵称'], //
			['显示', '存款时间'], //
			['输入', '孩子年龄'], //
		],
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我的家庭', // 
				'BX', '家庭id'
			], // 

			['MF_我是管理员', ], // 

		],

	},

	VIEW: {

		VIEW: [ // =========
			['显示', '家庭id'], //
			['显示', '孩子昵称'], //
			['显示', '存款时间'], //
			['显示', '孩子年龄'], //
			['_'], // 
			['跳转', '修改存款'], // 
			['_'], // 
			['跳转', '孩子取消任务', '取消任务'], // 
			['_'], // 
			['跳转', '孩子结束任务', '结束任务'], // 
			['_'], // 
			['跳转', 'db历史', '查看记录'], // 
		],
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我的家庭', // 
				'BX', '家庭id'
			], // 

		],

	},

	// 
	NEW: {

		VIEW: [ // ----------------------
			['输入', '孩子昵称'], //
			['输入', '孩子年龄'], //
		],
		// ---------------------------------
		权限: [ // ------------------<权限>

			['MF_我是管理员', ], // 

		],
		// ---------------------------------
		接收: [ // ------------------ <接收>

			['SF_set', // 
				'BX', '家庭id', 'XD', '$XD_家庭ID', //
			], //

		],

	},

});