ROOT.add_DB('db家长', {
	
	DB : {
		家长id : {
			类型 : 'ID',
			主键 : true,
			自增加 : true,
		},

		称谓 : {
			类型 : '昵称',
		},

		家庭id : {
			类型 : 'ID',
			引用 : 'db家庭',
		},

		权限 : {
			类型 : '选项',

			// byte
			opt : [ //
			'家长', //
			'管理员', //
			],
		},

	},

	BUF : {
		DB : 'ALL',
	},

	Item : {

		大标题b : '称谓',

		小标题b : '权限',

	},

	DEL : {

		// ---------------------------------
		权限 : [// ------------------<权限>

		[ 'MF_我的家庭',// 
		'BX', '家庭id' ], // 

		[ 'MF_这个家长不是我',// 
		'BX', '家长id' ], // 

		[ 'MF_我是管理员', ], // 

		],

	},

	EDIT : {

		VIEW : [// -----------------------
		[ '显示', '用户名' ],// 
		[ '输入', '称谓', '如:爸爸,奶奶' ],// 
		[ '输入', '权限' ],// 

		],
		// ---------------------------------
		权限 : [// ------------------<权限>

		[ 'MF_我的家庭',// 
		'BX', '家庭id' ], // 

		[ 'MF_我是管理员', ], // 

		],// ---------------------------------

	},

	VIEW : {

		VIEW : [// -----------------------

		[ '按键', '获取登录码' ],// 跳转 // 跳转前必须确定 同步完成

		[ '_' ],// 
		[ '显示', '用户名' ],// 
		[ '显示', '称谓' ],// 
		[ '显示', '权限' ],// 

		[ '_' ],// 
		[ '按键', '修改密码' ],// 跳转 // 跳转前必须确定 同步完成

		],
		// ---------------------------------
		权限 : [// ------------------<权限>

		[ 'MF_我的家庭',// 
		'BX', '家庭id' ], // 

		],

	},

// 

});