ROOT.add_PAGE('奖励', {

	DB: [ // ------------------------
		['A', 'db奖品', 'S', [ //
			'奖品id', //
		]], //

		['B', 'db孩子', 'U', [ //
			'孩子id', //
		]], //

		['L', 'db历史', 'I', ], //
	],

	// 
	JP: [ // 节拍
		{
			B: 'B', // db孩子
		}, //

		// 可以是'无A 或 B'
		// 因为每个ARR都有'主键'与'A'对应
		{
			ARR: ['A', ], // db奖品
		}, //
	],

	// ---------------------------------
	监听: [ // ------------------<监听>

		['page创建', //
			//
			['SF_如null输入', //
				'B', '孩子id', //
				'A', '奖品id', // 
			], //
			//
		],

	], // -------------------------------
	权限: [ // ------------------<权限>

		['MF_孩子正忙', // 
			'B', '孩子id'
		], // 

		['MF_我的家庭', // 
			'B', '家庭id'
		], // 

	],
	// ---------------------------------
	接收: [ // ------------------ <接收>

		['SF_等值', // 
			'A', '家庭id', //
			'B', '家庭id', // 
			'常串', '数据异常', // 异常返回串
		], //

		['SF_算式', // 只能操作数
			'B', '存款时间', // 结果保存位置
			'a-b', // 算式
			'B', '存款时间', // a
			'A', '扣除时间', // b
		], //

		['MF_奖励简报', // 
			'L', '简报', // 
			'A', '奖品名称', //
		], //

		['SF_算式', // 只能操作数
			'L', '变化', // 结果保存位置
			'a*b', // 算式
			'常数', '-1', // 'a'
			'A', '扣除时间', // 'b'
		], //

		['SF_set', // 
			'L', '孩子id', 'B', '孩子id', //
			'L', '家长id', 'XD', '$XD_我的ID', //
		], //

	],

});