/**
 * 家庭管理员读取登录数据 ,
 * 
 * 通过二维码显示出来, 方便其他'家长'扫描登录
 */

ROOT.add_PAGE('获取登录码', {

	DB: [ // ------------------------
		// - G - get一个没有BUF的数据行
		// 不缓存( No BUF ) 默认返回加密
		['A', 'db登录', 'G', [ // 
			'家长id', //
		]], //

		['B', 'db家长', 'S', [ //
			'家长id', //
		]], //

	],

	// ---------------------------------
	监听: [ // ------------------<监听>

		['更新OK', //
			['SF_显示对象二维码', // 
				'A'
			], //
		], //

	], // ---------------------------------
	权限: [ // ------------------<权限>

		['MF_我的家庭', // 
			'B', '家庭id'
		], // 

		['MF_我是管理员', ], // 
	],

});