ROOT.add_PAGE('孩子结束任务', {

	DB: [ // ------------------------

		['A', 'db孩子', 'U', [ //
			'孩子id', //
		]], //

		['C', 'db执行中', 'D', [ //
			'孩子id', //
			'剧本id', //
		]], //

		['J', 'db剧本', 'S', [ //
			'剧本id', //
		]],

		['B', 'db历史', 'I', ], //
	], // ---------------------------

	// 
	JP: [ // 节拍
		{

			// 堵塞'JP块'
			// A : 对版本号敏感 ( 发现不对 , 返回异常 )
			// B : 对版本号不敏感 ( 只堵塞 , 其他不管 )
			A: 'A',
			ARR: ['C', 'B'], // 始终敏感
		}, //

		{

			// 堵塞'JP块'
			// A : 对版本号敏感
			// B : 对版本号不敏感
			B: 'J',

		}, //
	],

	// ---------------------------------
	权限: [ // ------------------<权限>

		['MF_孩子正忙', // 
			'A', '孩子id'
		], // 

		['MF_我的家庭', // 
			'A', '家庭id'
		], // 

		['MF_我是管理员', ], // 
	],
	// ---------------------------------
	接收: [ // ------------------ <接收>

		['SF_等值', // 
			'A', '孩子id', //
			'C', '孩子id', // 
			'常串', '数据异常', // 异常返回串
		], //

		['SF_等值', // 
			'J', '剧本id', //
			'C', '剧本id', // 
			'常串', '数据异常', // 异常返回串
		], //

		['MF_剧本执行时间变化', // 
			'B', '变化', // 
			'C', '开始时间', //
			'J', '剧本长度', //
		], //
		// $时间的变化 // 少了 10 分钟 或者 多了 10 分钟

		['SF_算式', // 只能操作数
			'A', '存款时间', // 结果保存位置
			'a+b', // 算式
			'A', '存款时间', // 'a'
			'B', '变化', // // 'b'
		], //

		['MF_剧本执行简报', // 
			'B', '简报', // 
			'B', '变化', // 
			'J', '剧本名字', // 
		], //

		['SF_set', // 
			'B', '孩子id', 'A', '孩子id', //
			'B', '家长id', 'XD', '$XD_我的ID', //
		], //

	],

});