var page模板 = {

	// 只在 <客户端> 执行

	// ---------------------------------
	监听 : [// ------------------ <监听>

	[ 'XX自定义XX', //
	[ '##set', // 
	'FLY', 'goPage', 'PageS', '剧本执行',//
	], //
	], //

	[ 'page创建', // 
	//
	],

	[ 'page跳出', //
	//
	],

	[ 'page跳回', //
	//
	],

	[ 'page清除', //
	//
	],

	[ '输入', 'B', '手机',//
	//
	// 输入处理 , ( 适用于 )
	// 针对 :
	// 用户名 ,
	// 昵称 ,
	// Email
	// 手机号
	// 密码
	// 串
	// 数

	// 输入 : 规则
	// 输入 后执行函数 , 在函数里更改了其他值 ,
	// 并不会再次触动 输入

	],

	[ '更新OK', //
	//
	],

	[ '更新EXP', //
	//
	],

	[ '更新', //
	//
	],

	],

}
