ROOT.PAGE.登录_自动 = {

	// 首个页面

	注册 : '登录_自动',

	加密 : {

		DB : [// ------------------------
		[ 'M', 'db登录', 'S', [//
		'用户id', //
		] ], //
		],

		密码 : '密码', // DB项 [ 'M', '密码' ],//

	},

	LSE : [// --------监听 --------

	[ 'page创建', 'M', function(bx, fly, sys) { // 输入后处理
		if (!sys.getXID('$XD_有登录数据')) {
			// 如果没有登录数据 , 自动跳到登录页面
			sys.goPage('登录_输入');
			return;
		}

		bx.put('家长id', sys.getXID('$XD_我的ID'));
		bx.put('密码', sys.getXID('$XD_密码'));
	} ],//

	// 服务器 返回
	[ '$_CallBack_$', function(fly, sys) {
		
	}, ],

	],

	// --------------------------------------
	// ------------ PHP , JS ----------------
	// --------------------------------------

	SER : [// ---------------------SER
	[ 'M',// select db登录
	'家长id', '#构造登录数据',//
	],//			

	],// ---------------------------SER end

// --------------------------------------
// ---------------- PHP ----------------
// --------------------------------------

}