// * * *
// VIEW_VIEW

// 没有 <输入> , 只有<显示>
//

// 可以有<按键> , <跳转>
//

// 如果有<EDIT>的权限 , 预留<EDIT>的进入<按键>
// 

var DB = {

	VIEW: [ // =========
		['显示', '家庭id'], //
		['显示', '孩子昵称'], //
		['显示', '存款时间'], //
		

		['按键', 'XXX'], // <VIEW> 独有
		// 如果 : 'XXX' 是一个<pageS>,默认跳转
		// 无需监听
		// 

		['显示', '孩子年龄'], //
		['_'], // 
	],
	// ---------------------------------
	监听: [ // ------------------<监听>

		['XXX', // // 不可能同时是<输入>和<按键>
			['SF_set', // 
				'后台控制', 'goPage', 'PageS', '登录_自动', //
			], //
		],

	],
	// ---------------------------------

}