SYS.扩展函数.SF_字串连加 = {


	例子: ['SF_字串连加', //
		'B', '名字', // 结果保存位置
		'常串', '过 ', // 
		'B', '分钟偏移', // 
		'常串', ' 分钟', // 
		// ...
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [ // 
		{ // 0
			前缀YES: [],
			前缀NO: [],
			// 
			变量名称YES: [],
			变量名称NO: [],
			// 
			类型YES: ['串'],
			类型NO: [],
			// 
			基础类型YES: [],
			基础类型NO: [],
			// 
			可以为0: true, // 
			// 
			只能是DB: false, // 不能是<FLY> <XD> 等
			// 
			只能是代码块: false, // 自动检查该代码块
			// 
			DB_YES: [], // 可用的<数据表>
			DB_NO: [],

			可以写: true;

			可以缺省: false, // 

			// 缺省值: '字串不一致', // 有缺省值 , 默认<可以缺省>
			// 
			// 重复: 0, // 重复从 0 再读入变量
		}, //
		{ // 1
			重复: 1, // 返回到 1 重新输入

			规则: function(加载器, arr, index, 检查) {
				检查.可以转换(arr[0], arr[index]);
			},
		},
	],

	规则: function(加载器, arr, 检查) {
		检查.参数个数不能少于(加载器, 3);

	},

};

// --------------------------------------
// 
// 

SYS.扩展组件.SF_等值 = {


	例子: ['SF_等值', // 
		'J', '剧本id', //
		'C', '剧本id', // 
		'常串', '数据异常', // 异常返回串
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [

		{ // 0

		}, //
		{ // 1	

		}, //
		{ // 2
			缺省值: '字串不一致',

		},


	],
	规则: function(加载器, arr, 检查) {
		检查.可以转换(arr[0], arr[1]);
	},
};

// --------------------------------------

SYS.扩展函数.SF_set = {


	例子: ['SF_set', // 
		'B', '用户id', 'A', '用户id', //
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],


	参数清单: [ // 
		{ // 0
			可以写: true;
		}, //
		{ // 1
			重复: 0, // 重复从 0 再读入变量
			规则: function(加载器, arr, index, 检查) {
				检查.可以转换(arr[index - 1], arr[index]);
			},
		},
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_DB定位 = {

	例子: ['SF_DB定位', // 
		'A', '孩子id', //
		'FLYc', '孩子id', // 
		'常串', '数据异常', // 定位失败
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [ // 
		{ // 0
			只能是DB: true, // 
		}, //
		{ // 1
			只能是DB: true, // 
		}, // 
		{ // 2 // 提示串
			前缀YES: ['常串'],
		},
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_存在 = {

	例子: ['SF_存在', // 
		'A', '孩子id', // <A> 里面存在 <孩子id>= <C.孩子id>
		'C', '孩子id', // 
		'常串', '数据异常', // 异常数据
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [ // 
		{ // 0
			只能是DB: true, // 
		}, //
		{ // 1
			只能是DB: true, // 
		}, // 
		{ // 2 // 提示串
			前缀YES: ['常串'],
		},
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_不存在 = {

	例子: ['SF_不存在', // 
		'A', '孩子id', // <A> 里面存在 <孩子id>= <C.孩子id>
		'C', '孩子id', // 
		'常串', '数据异常', // 异常数据
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [ // 
		{ // 0
			只能是DB: true, // 
		}, //
		{ // 1
			只能是DB: true, // 
		}, // 
		{ // 2 // 提示串
			前缀YES: ['常串'],
		},
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_UP = {

	例子: ['SF_UP', // 
		'J', '_'
	], //

	服务器: true,
	客户端: false,

	语言: ['php'],

	参数清单: [ // 
		{ // 0
			只能是DB: true, // 
		}, //
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_没异常 = {

	例子: ['SF_UP', // 
		'J', '_'
	], //

	服务器: true,
	客户端: true,

	语言: ['php', 'js'],

	参数清单: [ // 
		{ // 0
			只能是代码块: true, //自动检查该代码块	
		}, //
		{ // 1
			只能是代码块: true, //自动检查该代码块	
		}, //
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_标记监听 = {

	// 标记 执行对象 , 但暂时不执行 , 
	// 等 <进程> 准备把<控制权> 交还给<前台>时 
	// 再执行标记了的<对象>
	例子: ['SF_标记监听', // 
		'常串', '计算家庭有多少个孩子', //
	], //

	服务器: false,
	客户端: true,

	语言: ['js'],

	参数清单: [ // 
		{ // 0
			前缀YES: ['监听'],
			重复: 0, // 返回到 1 重新输入
		}, //
	],

};

// --------------------------------------
// 
SYS.扩展函数.SF_选项 = {

	例子: ['SF_选项', // 
		'A', '权限', //
		['家长', // -- 选项 1
			['SF_set', // --
				/*  */
				'FLY', 'ERR', '布尔', 'false', //
			], //
		],

		['管理员', // -- 选项 2
			['SF_set', // ---
				/*  */
				'FLY', 'ERR', '布尔', 'false', //
			], //
		], // 

	], //

	服务器: false,
	客户端: true,

	语言: ['js'],

	参数清单: [ // 
		{ // 0
			只能是DB: true,
			类型YES: ['选项'],
		}, //
		{ // 1
			重复: 1, // 返回到 1 重新输入

			规则: function(加载器, arr, index, 检查) {
				var o = arr[index];

				检查.选项包含(arr[0], o[0]);

				for (var i = 1; i < o.length; i--)
					检查.语句块(o[i]);

			},
		}, //
	],

};


// --------------------------------------
//